Revit 2024 API
PolymeshTopology.GetFacet Method
 Returns a definition of one facet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PolymeshFacet GetFacet(
	int idx
)
Visual Basic
Public Function GetFacet ( _
	idx As Integer _
) As PolymeshFacet
Visual C++
public:
PolymeshFacet^ GetFacet(
	int idx
)
Parameters
idx
Type: System.Int32
 A zero-based index of the facet
Return Value
 An instance of PolymeshFacet that represents one facet defined by 3 vertices of the polymesh.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value is not a valid index of a facet of the polymesh. A valid value is not negative and is smaller than the number of facets in the polymesh.
See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace